# SaveAs Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentEntryPoint..::..SaveAs Method
DocumentEntryPoint Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SaveAs(String) | Saves the document to a given file path.  (Inherited from Document.) |
| SaveAs(String, SaveAsOptions) | Saves the document to a given file path.  (Inherited from Document.) |
| SaveAs(ModelPath, SaveAsOptions) | Saves the document to a given path.  (Inherited from Document.) |

# See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace